In [1]:
import pandas as pd

In [17]:
data={"name":['atul','akash','amit','ankit','akashay','abhay'],
     "age":[21,20,23,22,8,12],
     "class":[12,11,13,14,2,8],
     "qualification":['diploma','iti','bsc','ba','fifth','second']}
df=pd.DataFrame(data)
print(df)

      name  age  class qualification
0     atul   21     12       diploma
1    akash   20     11           iti
2     amit   23     13           bsc
3    ankit   22     14            ba
4  akashay    8      2         fifth
5    abhay   12      8        second

In [18]:
#using .loc method

#selecting three rows and two columns
df.loc[1:3 ,["name", "class"]]

    name  class
1  akash     11
2   amit     13
3  ankit     14

In [19]:
#selecting three rows and name to qualification all columns
df.loc[0:2 , "name":"qualification"]

    name  age  class qualification
0   atul   21     12       diploma
1  akash   20     11           iti
2   amit   23     13           bsc

In [20]:
# .loc DataFrame method 
# filtering rows and selecting columns by label 
# format 
# df.loc[rows, columns] 
# row 1, all columns 
df.loc[0, :]

name                atul
age                   21
class                 12
qualification    diploma
Name: 0, dtype: object

In [21]:
#using iloc method

# Remember that Python does not 
# slice inclusive of the ending index. 
# select all rows  
# select first two column 
df.iloc[:, 0:2]

      name  age
0     atul   21
1    akash   20
2     amit   23
3    ankit   22
4  akashay    8
5    abhay   12

In [22]:
#using all  rows and some columns

# iloc[row slicing, column slicing] 
df.iloc [0:2, 1:3]

   age  class
0   21     12
1   20     11

In [26]:
#using .ix method
# select all rows and 0 to 2 columns  
print(df.ix[:, 0:2])

      name  age
0     atul   21
1    akash   20
2     amit   23
3    ankit   22
4  akashay    8
5    abhay   12

/home/monu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [27]:
#Addition of column
address=["up","delhi","mp","bihar","mumbai","uk"]
df["Address"]=address
print(df)

      name  age  class qualification Address
0     atul   21     12       diploma      up
1    akash   20     11           iti   delhi
2     amit   23     13           bsc      mp
3    ankit   22     14            ba   bihar
4  akashay    8      2         fifth  mumbai
5    abhay   12      8        second      uk

In [30]:
#using .insert method
#it provide to add columns in at any position where you want to insert
 
# Using DataFrame.insert() to add a column 
df.insert(1, "lastname", ["patel","verma","soni","singh","gupta","pandey"], True) 
  
# Observe the result 
df

      name lastname  age lastname  class qualification Address
0     atul    patel   21    patel     12       diploma      up
1    akash    verma   20    verma     11           iti   delhi
2     amit     soni   23     soni     13           bsc      mp
3    ankit    singh   22    singh     14            ba   bihar
4  akashay    gupta    8    gupta      2         fifth  mumbai
5    abhay   pandey   12   pandey      8        second      uk

In [32]:
#using .assign method
# Using 'Address' as the column name and equating it to the list 
df2 = df.assign(address = ['Delhi', 'Bangalore', 'Chennai', 'Patna','lanka','cp']) 
   
# Observe the result 
df2

      name lastname  age lastname  class qualification Address    address
0     atul    patel   21    patel     12       diploma      up      Delhi
1    akash    verma   20    verma     11           iti   delhi  Bangalore
2     amit     soni   23     soni     13           bsc      mp    Chennai
3    ankit    singh   22    singh     14            ba   bihar      Patna
4  akashay    gupta    8    gupta      2         fifth  mumbai      lanka
5    abhay   pandey   12   pandey      8        second      uk         cp